{
  "main": {
    "name":"Dmitry Kutin",
    "description":"Fourth Year Student at the University of Ottawa working towards a BSc with Honours in Computer Science, Management and Entrepreneurship Option",
    "bio":"Originally from Toronto, Ontario, a motivated young professional tooled towards web development with over a year of development experience using Git, PHP, HTML, CSS, JavaScript, React.js, MySQL, with experience using C and Java for course work. When I'm not coding, I'm found at the gym, outdoors, or honing my chess skills.",
    "email": "dmitrykutin@outlook.com",
    "phone": "905-466-6980",
    "resumedownload": "",
    "social": [
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/dmitry-kutin-527032189/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/dkutin",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"University of Ottawa",
        "degree":"BSc Specialization in Computer Science, Management, Entrepreneurship Option",
        "description":"Classes in Data Structures and Algorithms, Operating Systems, Software Engineering, Discrete Structures, Computer Architecture and various core Business Management courses"
      }
    ],
    "work":[
      {
        "company":"University of Ottawa",
        "title":"Junior Web Developer",
        "years":"May 2019 - Present",
        "description":"Full-Stack development with a medium sized development team working in an Agile environment employing scrum.",
        "contribution": "Assisting in developing key university websites using the Drupal 7 framework, migrating content and custom modules from Drupal 7 to Drupal 8, and development of a campus-wide emergency management notification system."
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Fantasy Tracker -- A Yahoo! API based application",
        "description":"A work in progress: Created to show player trends in Yahoo! Fantasy Basketball -- customizable to each fantasy league and viewable on a centralized web page with DBMS for authenticated and non-authenticated users.",
        "contribution" : "Handling and calling APIs, storing them in a MySQL Database focused on backend with a PHP dominant codebase.",
        "image":"fantasytracker.jpg",
        "url":"https://dkutin.github.io/fantasytracker",
        "repo": "https://github.com/dkutin/fantasytracker"
      },
      {
        "title":"My Portfolio Site",
        "description" : "This site was created with React.js, HTML, CSS, Javascript -- hosted on Github Pages. A showcase of my past work in my undergraduate degree and various personal projects I (somehow) found time to bring to life.",
        "contribution" : "Furthered my skills with HTML, CSS and JS. Experimented with UX/UI design in Adobe XD, able to implement my desired look and feel learning React.js",
        "image":"portfolio.jpg",
        "url":"#home",
        "repo": "https://github.com/dkutin/dkutin.github.io/"
      }
    ]
  }
}
